"""
http://blog.naver.com/nasu0210/220804358762
{'이름':'홍길동','나이':22,'국어':77,'영어':88,'수학':90}
{'이름':'김철수','나이':32,'국어':87,'영어':67,'수학':30}
{'이름':'이영희','나이':29,'국어':100,'영어':70,'수학':84}
{'이름':'김민우','나이':11,'국어':100,'영어':90,'수학':89}
{'이름':'문서영','나이':13,'국어':95,'영어':97,'수학':92}
"""
s = list()
s.append({'이름':'홍길동','나이':22,'국어':77,'영어':88,'수학':90})
s.append({'이름':'김철수','나이':32,'국어':87,'영어':67,'수학':30})
s.append({'이름':'이영희','나이':29,'국어':100,'영어':70,'수학':84})
s.append({'이름':'김민우','나이':11,'국어':100,'영어':90,'수학':89})
#print(type(s)) #<class 'list'>
#print(s)

"""
cnt = 0
for i in s:
    cnt = cnt +1
    z = cnt -1
    #print(type(i)) #<class 'dict'>
    #print(i, cnt) #{'이름': '홍길동', '나이': 22, '국어': 77, '영어': 88, '수학': 90} 1
    #print(i, i['이름']) #{'이름': '홍길동', '나이': 22, '국어': 77, '영어': 88, '수학': 90} 홍길동
    if(i['이름']=='이영희'):
        total = i['국어'] + i['영어'] + i['수학']
        avg = int(total/3)
        print('이름 : ', i['이름'], ' 총점 : ', total, ' 평균 : ', avg)
"""

print('len : ', len(s))

#for i in range(len(s)):
_tot = 0
_avg = 0
_cnt = 0
for i in s:
    i['총점'] = i['국어'] + i['영어'] + i['수학']
    i['평균'] =  round(i['총점'] / 3, 2)
    _tot = _tot + i['총점']
    _cnt = _cnt + 1
    print(i)

#전체평균
_avg = _tot/len(s)/3
print(_tot, len(s), _cnt, _avg)

"""
for i in s:
    i['총점'] = i['국어'] + i['영어'] + i['수학']
    i['평균'] =  round(i['총점'] / 3, 2)
    if(i['평균']<_avg) :
        print('이름 : ', i['이름'], ' | 평균 : ', i['평균'], ' | 전체평균 : ', _avg)
"""
