"""
#...[파이썬 기초] 데이터 구조 활용 (리스트와 딕셔너리 응용) : http://blog.naver.com/nasu0210/220775490306
"""

li=[{'이름':'홍길동','나이':17,'성별':'남','국어':80,'영어':90,'수학':77},
    {'이름':'김철수','나이':22,'성별':'남','국어':77,'영어':64,'수학':88},
    {'이름':'이영희','나이':23,'성별':'여','국어':72,'영어':99,'수학':65},
    {'이름':'김민우','나이':31,'성별':'남','국어':50,'영어':55,'수학':60},
    {'이름':'문서영','나이':13,'성별':'여','국어':100,'영어':15,'수학':20}]

"""
#..국어의 총점.방법1.
tot = 0
for i in range(len(li)):
    tot += li[i]['국어']
print('국어총점 : ', tot)

"""

"""
#..국어의 총점.방법2.
tot = 0
for i in li:
    tot += i['국어']
print('국어총점 : ', tot)
"""

"""
#...성별이 '여'인 사람의 국어총점.
tot = 0
for i in li:
    if(i['성별']=='여'):
        tot+=i['국어']
print('국어총점 : ', tot)
"""

"""
#...성별이 '여'인 사람을 삭제하기.
for i in li:
    if i['성별']=='여':
        li.remove(i)
print(li)
"""

"""
#...총점 항목을 추가하기.
for i in li:
    tot=0
    tot+=i['국어']+i['영어']+i['수학']
    i['총점']=tot
print(li)
"""

#...나이가 20대인 새로운 리스트를 만들기.
li2=[i for i in li if (i['나이']>20 and i['나이']<30)]
print(li2)