li=['빨강', '주황', '노랑', '초록', '파랑', '남색', '보라']
print(li)

for i in li:
    print(i, end=' ')
    
print('===============')

li=[{'이름':'홍길동','나이':17,'성별':'남','국어':80,'영어':90,'수학':77},
    {'이름':'김철수','나이':22,'성별':'남','국어':77,'영어':64,'수학':88},
    {'이름':'이영희','나이':23,'성별':'여','국어':72,'영어':99,'수학':65},
    {'이름':'김민우','나이':11,'성별':'남','국어':50,'영어':55,'수학':60},
    {'이름':'문서영','나이':13,'성별':'여','국어':100,'영어':15,'수학':20}]
#list 에 딕셔너리가 5개 있음.
print(li[1]['나이']) #딕셔너리는 key 로 접근해야 함.
print(li[3]['나이'])
print('-------------------------')

#이 반 학생의 나이의 평균과 총합.
avg = int()
ttl = int()
for i in li:
    ttl = ttl + i['나이']
    avg = ttl/len(li)
print('나이총합', ttl)
print('나이평균', avg)
print('-------------------------')

#이 반 학생의 남학생의 인원수.
countM = int()
ttl = int()
for i in li:
    if i['성별'] == '남':
        countM = countM + 1
print('남자인원', countM)
print('여자인원', len(li) - countM)
print('-------------------------')
